Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The rest client supports asynchronous rest calls. Async support comes in 2 flavors: you can return a `CompletionStage` or a `Uni` (requires the `quarkus-rest-client-mutiny` extension). Let's see it in action by adding a `getByIdAsync` method in our `ExtensionsService` REST interface. The code should look like:
ja_jp: rest クライアントは非同期の rest 呼び出しをサポートしています。非同期のサポートには、2パターンあります。 `CompletionStage` を返却するか `Uni` ( `quarkus-rest-client-mutiny` のエクステンションが必要です) を返却するかです。 `ExtensionsService` REST インタフェースに `getByIdAsync` メソッドを追加してみましょう。コードは以下のようになります。

source: The rest client supports asynchronous rest calls. Async support comes in 2 flavors: you can return a `CompletionStage` or a `Uni` (requires the `quarkus-resteasy-client-mutiny` extension). Let's see it in action by adding a `getByIdAsync` method in our `ExtensionsService` REST interface. The code should look like:
ja_jp: rest クライアントは非同期の rest 呼び出しをサポートしています。非同期のサポートには、 `CompletionStage` と `Uni` ( `quarkus-resteasy-client-mutiny` エクステンションモジュールが必要) の 2 種類があります。 `ExtensionsService` REST インターフェイスに `getByIdAsync` メソッドを追加してみましょう。コードは次のようになります：

source: The rest of the documentation show usages based on the active record pattern only, but keep in mind that they can be performed with the repository pattern as well. The repository pattern examples have been omitted for brevity.
ja_jp: 残りのドキュメントでは、アクティブレコードパターンに基づく使用法のみを示していますが、リポジトリパターンでも実行できることを覚えておいてください。リポジトリパターンの例は簡潔にするために省略しています。

source: The rest of the post explains how you can send and receive Cloud Events using Quarkus, Kafka, and Reactive Messaging.
ja_jp: 残りの記事では、Quarkus、Kafka、Reactive Messagingを使用してクラウドイベントを送受信する方法を説明しています。

source: The rest of the registries are hosted in the Quarkiverse (our home for additional extensions):
ja_jp: 残りのレジストリーはQuarkiverseでホストされています(追加のエクステンションのためのホーム):

source: The rest of this section explores ways to build the native executable with extra information, but first, stop the running application. We can obtain this information while building the native executable by adding additional native-image build options using `-Dquarkus.native.additional-build-args`, e.g.
ja_jp: このセクションの残りの部分では、追加情報を使用してネイティブ実行可能ファイルをビルドする方法について説明しますが、最初に、実行中のアプリケーションを停止します。 `-Dquarkus.native.additional-build-args` を使用してネイティブイメージビルドオプションを追加することで、ネイティブ実行可能ファイルのビルド中にこの情報を取得できます。

source: The result is a significant improvement in JVM startup time, with very few constraints or drawbacks.
ja_jp: その結果、制約や欠点がほとんどなく、JVM の起動時間が大幅に改善されます。

source: The result is captured by Quarkus and written in the HTTP response
ja_jp: 結果はQuarkusによってキャプチャされ、HTTPレスポンスに書き込まれます。

source: The result of `myData.template` will be used as the template. The template is executed with the <<current_context_object>>, i.e. can reference data from the template it's included into.
ja_jp: `myData.template` の結果がテンプレートとして使用されます。テンプレートは <<current_context_object>> で実行されます。つまり、インクルードされているテンプレートのデータを参照することができます。

source: The result of `myData.template` will be used as the template. The template is executed with the xref:current_context_object[Current Context], i.e. can reference data from the template it's included into.
ja_jp: `myData.template` の結果がテンプレートとして使用されます。テンプレートは xref:current_context_object[現在のコンテキスト] で実行されるため、インクルードされるテンプレートに含まれるデータを参照することができます。

source: The result of an easier learning curve as one developer explains:
ja_jp: ある開発者は、学習曲線が容易になった結果をこのように述べています:

source: The result of the build is a directory under `target` named `quarkus-app`.
ja_jp: ビルドの結果は、 `quarkus-app` という名前の `target` の下のディレクトリーです。

source: The result of the previous command is a single JAR file inside the `target/deployment` repository that contains classes and dependencies of the project.
ja_jp: 前のコマンドの結果、 `target/deployment` リポジトリ内に単一の JAR ファイルが生成されます。このJARファイルにはプロジェクト内のクラスと、依存関係のクラスが含まれています

source: The result of this command is dependent on your build tool:
ja_jp: このコマンドの結果は、お使いのビルドツールに依存します:

source: The result of this flag (plus the `-Dquarkus.package.jar.appcds.enabled=true` original one) is the creation of an AOT cache file named `app.aot`.
ja_jp: このフラグ（とオリジナルのフラグ `-Dquarkus.package.jar.appcds.enabled=true` ）の結果、 `app.aot` という名前のAOTキャッシュファイルが作成されます。

source: The result of using these flags is the creation of an AOT cache file named `app.aot`.
ja_jp: これらのフラグを使用することによる結果は、`app.aot` という名前の AOT キャッシュファイルが作成されることです。

source: The result should be:
ja_jp: 結果は次のようになります。

source: The result should be: `HELLO WORLD!`.
ja_jp: 結果は次のようになります： `HELLO WORLD!`.

source: The result should be: `Hello world` as it is the value obtained from the Spring Cloud Config server.
ja_jp: 結果は、Spring Cloud Configサーバから取得した値であるため、 `Hello world` となるはずです。

source: The result should be: `{"message": "hello"}`.
ja_jp: 結果は `{"message": "hello"}` のようになります。

source: The result would be something like `<p>This is my custom title!</p>`.
ja_jp: 結果は、`<p>これは私のカスタムタイトル!</p>` のようになります。

source: The result would be:
ja_jp: 結果は次のようになります。

source: The resulting SBOM will include
ja_jp: 結果として得られる SBOM には以下が含まれます。

source: The resulting bean class is something like `public class @Singleton MyBean { }`.
ja_jp: 結果の Bean クラスは、次のようになります: `public class @Singleton MyBean { }`。

source: The resulting executable is small, leading to much smaller container images.
ja_jp: 結果として生成される実行可能ファイルは小さく、より小さなコンテナーイメージにつながります。

source: The resulting executable use ~46 MB of disk space:
ja_jp: 結果、実行可能ファイルは46MBのディスクスペースを使用します。

source: The resulting list will contain `@Named` synthetic beans.
ja_jp: 結果のリストには、 `@Named` 合成 Bean が含まれます。

source: The resulting list will not contain `@Named` synthetic beans.
ja_jp: 結果のリストに `@Named` 合成 Bean は含まれません。

source: The resulting message contains the MDC data:
ja_jp: 結果のメッセージには MDC データが含まれます。

source: The results of the pipeline are written out to the `temperatures-aggregated` topic
ja_jp: パイプラインの結果は `temperatures-aggregated` トピックに書き出しています

source: The retrieved `MailClient` is configured using the configuration key presented above. You can also create your own instance, and pass your own configuration.
ja_jp: 取得した `MailClient` は、上記で提示した設定キーを使用して設定します。また、独自のインスタンスを作成し、独自の設定を渡すこともできます。

source: The retrieved `MailClient` is configured using the configuration property presented above. You can also create your own instance, and pass your own configuration.
ja_jp: 取得した `MailClient` は、上で示した設定プロパティを使って設定します。 独自のインスタンスを作成し、独自の設定を渡すこともできます。

source: The retrieved chunks, along with metadata from the "Metadata Store" (which acts as the "source of truth"), are assembled into a "Context Pack".
ja_jp: 取得されたチャンクは、「Metadata Store」（「信頼できる情報源」として機能）からのメタデータとともに、「Context Pack」に組み立てられます。

source: The return object in these methods can be:
ja_jp: これらのメソッドで返されるオブジェクトは次のとおりです。

source: The return type `Uni<Void>` instructs the scheduler to execute the method on the Vert.x event loop.
ja_jp: リターンタイプ `Uni<Void>` は、Vert.xのイベントループでメソッドを実行するようにスケジューラに指示します。

source: The return type of the observer _does not matter_. The return value of the observer is _ignored_.
ja_jp: オブザーバーの戻り値の型は重要ではありません。 オブザーバーの戻り値は無視されます。

source: The return value of the `service.ping()` invocation will be cached. The cache will be named like `org.example.PingService#ping()`.
ja_jp: `service.ping()` 呼び出しの戻り値はキャッシュされます。キャッシュは `org.example.PingService#ping()` のように命名されます。

source: The right positioning (cloud native, developer joy, …) with versatility
ja_jp: 汎用性のある適切なポジショニング（クラウドネイティブ、デベロッパー満足度、...）。

source: The road ahead: Vert.x 4!
ja_jp: 今後の道:Vert.x 4!

source: The role of analyzers is to split the text into tokens (~ words) and filter them (making it all lowercase and removing accents for instance).
ja_jp: アナライザーの役割は、テキストをトークン（～単語）に分割し、フィルターをかけることです（例えば、すべて小文字にしたり、アクセントを削除したり）。

source: The role policy `role-policy1` allows only authenticated requests to access `/crud/modify` and `/crud/id` sub-paths. For more information about the path-matching algorithm, see <<matching-multiple-paths>> later in this guide.
ja_jp: ロールポリシー `role-policy1` は、認証されたリクエストのみが `/crud/modify` および `/crud/id` サブパスにアクセスできるようにします。 パスマッチングアルゴリズムの詳細は、このガイドの <<matching-multiple-paths>> を参照してください。

source: The root logger category is handled separately, and is configured by using the following properties:
ja_jp: ルート・ロガー・カテゴリーは別個に扱われ、以下のプロパティを使用して設定されます：

source: The root logger category is handled separately, and is configured via the following properties:
ja_jp: ルート ロガー カテゴリは個別に処理され、次のプロパティーで設定されます。

source: The root logger configuration is used if no specific configurations are provided for the category and any of its parent categories.
ja_jp: カテゴリおよびその親カテゴリのいずれにも特定の設定が提供されていない場合、 ルート・ロガー設定が使用されます。

source: The root pom.xml MUST inherit from `io.quarkiverse:quarkiverse-parent`
ja_jp: ルート pom.xml は `io.quarkiverse:quarkiverse-parent` を継承しなければなりません

source: The router is mostly used internally. This uses https://github.com/vaadin/router[Vaadin Router] under the covers to route URLs to the correct page/section within the SPA. It will update the navigation and allow history (back button). This also creates the sub-menu available on extensions that have multiple pages.
ja_jp: ルーターは主に内部で使用されます。これは、SPA内の正しいページ/セクションにURLをルーティングするために、隠れて link:https://github.com/vaadin/router[Vaadin Router] を使用しています。これはナビゲーションを更新し、履歴(戻るボタン)を許可します。これはまた、複数のページを持つエクステンションで利用可能なサブメニューを作成します。

source: The rsync command is specific for Linux. For other operating systems please substitute with an equivalent command.
ja_jp: rsyncコマンドは、Linux専用です。他のOSの場合は、同等のコマンドで代用してください。

source: The rules set is made of business decisions to approve or reject an application plus one last rule collecting all the approved applications into a list.
ja_jp: ルールセットは、アプリケーションを承認または拒否するビジネス上の決定と、承認されたすべてのアプリケーションをリストに収集する最後の 1 つのルールで設定されます。

source: The running Infinispan Server has authentication enabled and a user with full admin role. The credentials of the user are *admin/password*.
ja_jp: 実行中のInfinispan Serverは認証が有効で、フル管理者ロールを持つユーザーがいます。このユーザーのクレデンシャルは *admin/password* です。

source: The runtime ClassLoader is always isolated. This means that it will have its own copies of almost every class from the resolved dependency list. The exception to this are:
ja_jp: ランタイムの ClassLoader は常に分離されています。これは、解決された依存関係リストのほとんどすべてのクラスの独自のコピーを持つことを意味します。これには例外があります:

source: The runtime is all the actions that happen when you execute your application. It's obviously focused on starting your business-oriented actions but it relies on a lot of technical actions like loading libraries and configuration files, scanning the application's classpath, configuring the dependency injection, setting up your Object-Relational Mapping, instantiating your REST controllers, etc.
ja_jp: 実行時はアプリケーションを実行するときに起こるすべてのアクションです。 ランタイムは明らかにビジネス指向のアクションを開始することに重点を置いていますが、ライブラリや設定ファイルのロード、アプリケーションのクラスパスのスキャン、依存性注入の設定、オブジェクトリレーショナルマッピングの設定、RESTコントローラのインスタンス化など、多くの技術的なアクションに依存しています。

source: The runtime is all the actions that happen when you execute your application. It's obviously focused on starting your business-oriented actions, but it relies on a lot of technical actions like loading libraries and configuration files, scanning the application's classpath, configuring the dependency injection, setting up your Object-Relational Mapping, instantiating your REST controllers, etc.
ja_jp: 実行時はアプリケーションを実行するときに起こるすべてのアクションです。 実行時は明らかにビジネス指向のアクションを開始することに重点を置いていますが、ライブラリや設定ファイルのロード、アプリケーションのクラスパスのスキャン、依存性注入の設定、オブジェクトリレーショナルマッピングの設定、RESTコントローラのインスタンス化など、多くの技術的なアクションに依存しています。

source: The runtime module
ja_jp: 実行時モジュール

source: The runtime module - in this blog post, we won't modify it
ja_jp: ランタイムモジュール - このブログ記事では変更しません。

source: The runtime module applies the `io.quarkus.extension` plugin. This will:
ja_jp: 実行時モジュールは `quarkus-arc` アーティファクトに依存しています。

source: The runtime module depends on the `quarkus-arc` artifact.
ja_jp: 実行時モジュールは `quarkus-arc` アーティファクトに依存しています。

source: The runtime profile has absolutely no effect on the bean resolution using `@IfBuildProfile` and `@UnlessBuildProfile`.
ja_jp: ランタイムプロファイルは、 `@IfBuildProfile` および `@UnlessBuildProfile` を使用した Bean 解決には影響を及ぼしません。

source: The same JVM system properties as before can be added to containerized Quarkus applications by editing the `+Dockerfile.jvm+` under `+src/main/docker/+`. Below is a sample `+Dockerfile.jvm+` from a basic Quarkus project - pay attention to the `+ENV JAVA_OPTS_APPEND+` line that has been added to append the JVM properties and expose the port number:
ja_jp: コンテナ化されたQuarkusアプリケーションに、以前と同じJVMシステムプロパティを追加するには、 `src/main/docker/` の下にある `Dockerfile.jvm` を編集します。 `Dockerfile.jvm` 以下は、基本的なQuarkusプロジェクトのサンプルです。JVMプロパティを追加し、ポート番号を公開するために追加された `ENV JAVA_OPTS_APPEND` の行に注目してください。

source: The same applies to all properties listed below.
ja_jp: 以下にリストされているすべてのプロパティも同様です。

source: The same approach can be used with integration tests.
ja_jp: 結合テストでも同じアプローチが使えます。

source: The same authorization policies can be configured programmatically:
ja_jp: 同じ認可ポリシーをプログラムで設定できます。

source: The same caveats as described in the <<_lra-coordinators,the section on coordinators>> still apply:
ja_jp: <<_lra-coordinators,コーディネーターのセクション>>で説明した注意点と同じです。

source: The same data source will be used for all tenants and a schema has to be created for every tenant inside that data source.
ja_jp: すべてのテナントに同じデータソースが使用され、そのデータソース内のすべてのテナントに対してスキーマを作成する必要があります。

source: The same data source will be used for all tenants and a schema has to be created for every tenant inside that data source. CAUTION: Some databases like MariaDB/MySQL do not support database schemas. In these cases you have to use the DATABASE approach below.
ja_jp: すべてのテナントに同じデータソースを使用し、そのデータソース内に各テナント用のスキーマを作成する必要があります。注意：MariaDB/MySQLのような一部のデータベースは、データベーススキーマをサポートしていません。このような場合には、以下のようなDATABASEアプローチを使用する必要があります。

source: The same flow can be applied with any of the <<logging-apis,supported logging APIs>>.
ja_jp: <<logging-apis,supported logging APIs>> であれば、同じフローを適用できます。

source: The same flow can be applied with any of the xref:logging-apis[supported logging APIs].
ja_jp: 同じフローは、 xref:logging-apis[サポートされているどのロギングAPI] でも適用できます。

source: The same is true for your third-party libraries. If they happen to depend on servlets you need to find a migration path for them.
ja_jp: サードパーティのライブラリも同様です。もしそれらがサーブレットに依存しているのであれば、移行パスを見つける必要があります。

source: The same logic applies when saving a `Fruit`:
ja_jp: `Fruit` を保存するときに同じロジックが適用されます。

source: The same mongo connection will be used for all tenants, so a database has to be created for every tenant.
ja_jp: すべてのテナントに同じ mongo 接続が使用されるため、テナントごとにデータベースを作成する必要があります。

source: The same qualifier can be used to specify the `OidcClient` used for a `Tokens` injection:
ja_jp: 同じ修飾子を使用して、 `Tokens` 注入に使用する `OidcClient` を指定することができます。

source: The same query facility exists for the reactive types, but the `stream()` methods act differently: they return a `Multi` (which implement a reactive stream `Publisher`) instead of a `Stream`.
ja_jp: リアクティブ型に対しても同様の問い合わせ機能がありますが、 `stream()` メソッドの動作は異なります。 `Stream` の代わりに `Multi` （リアクティブストリーム `Publisher` を実装したもの）を返します。

source: The same result can also be achieved by adding the `@Authenticated` annotation on the interface instead of using the `authenticated` property
ja_jp: 同じ結果は、 `authenticated` プロパティーを使用する代わりに、インターフェースに `@Authenticated` アノテーションを追加することでも実現できます。

source: The same sequence of redirects that is described in the end of the <<vertx-oidc-vertx>> section also happened in this application, after you accessed `http://localhost:8080/protected`.
ja_jp: `http://localhost:8080/protected` にアクセスした後のリダイレクトシーケンスは、 <<vertx-oidc-vertx>> セクションの最後で説明したものと同じことがこのアプリケーションでも発生しました。

source: The same test scenarios can be refactored using this CDI bean accordingly.
ja_jp: 同じテストシナリオは、この CDI Bean を使用して適切にリファクタリングできます。

source: The same will happen if we're using the Kafka extension. All this configuration is well documented in https://quarkus.io/guides/micrometer[the Quarkus Micrometer guide].
ja_jp: Kafkaエクステンションを使用している場合も同様です。これらの設定については、 link:https://quarkus.io/guides/micrometer[Quarkus Micrometerガイド]によく書かれています。

source: The sample can be passed along as context
ja_jp: サンプルはコンテキストとして渡すことができます。

source: The sample project includes the RESTEasy Reactive, Undertow, Reactive Routes, xref:funqy-http.adoc[Funqy HTTP] extensions. If you are only using one of those APIs (i.e. jax-rs only), respectively remove the maven dependency `quarkus-resteasy-reactive`, `quarkus-undertow`, `quarkus-funqy-http`, and/or `quarkus-reactive-routes`.
ja_jp: サンプルプロジェクトには、RESTEasy、Undertow、Reactive Routes、 link:funqy-http.html[FunqyのHTTP] エクステンションが含まれています。これらの API のうち 1 つだけを使用する場合 (例: jax-rs のみ) は、それぞれ `quarkus-resteasy` , `quarkus-undertow` , `quarkus-funqy-http` ,および/または `quarkus-reactive-routes` の maven 依存関係を削除してください。

source: The sample project includes the RESTEasy, Undertow, Reactive Routes, xref:funqy-http.adoc[Funqy HTTP] extensions. If you are only using one of those APIs (i.e. jax-rs only), respectively remove the maven dependency `quarkus-resteasy`, `quarkus-undertow`, `quarkus-funqy-http`, and/or `quarkus-reactive-routes`.
ja_jp: サンプルプロジェクトには、RESTEasy、Undertow、Reactive Routes、 xref:funqy-http.adoc[Funqy HTTP] エクステンションが含まれています。これらのAPIの1つだけを使用する場合（つまり、jax-rsのみ）、それぞれmaven依存関係 `quarkus-resteasy` 、 `quarkus-undertow` 、 `quarkus-funqy-http` 、および/または `quarkus-reactive-routes` を削除します。

source: The scenario we mentioned above with `Tracer` could also be implemented in the following way:
ja_jp: `Tracer` を使用して上で述べたシナリオも、以下のように実装することができます。

source: The scheduler was paused.
ja_jp: スケジューラーが一時停止されました。

source: The scheduler was resumed.
ja_jp: スケジューラーが再開されました。

source: The scope of a bean determines the lifecycle of its instances, i.e. when and where an instance should be created and destroyed.
ja_jp: Beanのスコープはインスタンスのライフサイクルを決定します。

source: The scope of the bean must be active during execution.
ja_jp: Beanのスコープは、実行中を通じてアクティブです。

source: The scope of the mocked bean should be consistent with the original one.
ja_jp: モックされたビーンのスコープは、元のビーンと一致する必要があります。

source: The scope you choose for your `ConstraintValidator` bean is important:
ja_jp: `ConstraintValidator` Bean に選択するスコープは重要です:

source: The script above is generic enough to work with any Quarkus application, but it will only work with Mandrel 21.3.0.Final. GraalVM CE 21.3.0.Final lacks the symbolic links to make the `csv` file references work, so if you're on this GraalVM CE, you'll have to modify the CSV file names with project specific, timestamped, file names.
ja_jp: 上記のスクリプトは、どのようなQuarkusアプリケーションでも動作するように汎用的なものですが、Mandrel 21.3.0.Finalでのみ動作します。GraalVM CE 21.3.0.Finalでは、 `csv` ファイルの参照を動作させるためのシンボリックリンクがありませんので、このGraalVM CEを使用している場合は、CSVファイル名をプロジェクト固有のタイムスタンプ付きのファイル名に変更する必要があります。

source: The second Java process is where the main part of the native executable production happens. The `--verbose` option shows the actual Java process executed. You could take the output and run it yourself.
ja_jp: 2番目のJavaプロセスでは、ネイティブ実行可能ファイル作成の主要部分が行われます。 `--verbose` オプションは、実際に実行されたJavaプロセスを表示します。出力を受けて、自分で実行することもできます。

source: The second application, the _processor_, will read from the `quote-requests` topic, put a random price to the quote, and send it to a Kafka topic named `quotes`.
ja_jp: 2 つ目のアプリケーションである _processor_ は、 `quote-requests` トピックから読み取り、見積にランダムな価格を設定し、 `quotes` という名前の Kafka トピックに送信します。

source: The second application, the _processor_, will read from the `quote-requests` topic, put a random price to the quote, and send it to a Pulsar topic named `quotes`.
ja_jp: 2 つ目のアプリケーションである _processor_ は、 `quote-requests` トピックから読み取り、見積にランダムな価格を設定し、 `quotes` という名前の Pulsar トピックに送信します。

source: The second application, the `processor`, in turn, will read from the `quote-requests` queue put a random price to the quote, and send it to a queue named `quotes`.
ja_jp: 次に、2 番目のアプリケーションである `processor` は、 `quote-requests` キューから読み取り、見積もりにランダムな価格を設定し、それを `quotes` という名前のキューに送信します。

source: The second application, the `processor`, in turn, will read from the `quote-requests` queue put a random price to the quote, and send it to an exchange named `quotes`.
ja_jp: 2 番目のアプリケーションである `processor` は、 `quote-requests` のキューから読み取った見積にランダムな価格を付けて、 `quotes` という名前のエクスチェンジに送信します。

source: The second application, the `processor`, in turn, will read from the `quote-requests` queue, put a random price to the quote, and send it to a queue named `quotes`.
ja_jp: 次に、2 番目のアプリケーションである `processor` は、 `quote-requests` キューから読み取り、見積もりにランダムな価格を設定し、 `quotes` という名前のキューに送信します。

source: The second approach is to supply the properties as https://www.jaegertracing.io/docs/latest/client-features/[environment variables]. These can be specified as `jvm.args` as shown in the following section.
ja_jp: 2つ目の方法は、 link:https://www.jaegertracing.io/docs/latest/client-features/[環境変数] としてプロパティーを供給することです。これらは、次のセクションに示すように `jvm.args` として指定することができます。

source: The second approach is to supply the properties as https://www.jaegertracing.io/docs/latest/client-features/[environment variables]. These can be specified using `jvm.args` as shown in the following section.
ja_jp: 2つ目の方法は、プロパティを link:https://www.jaegertracing.io/docs/latest/client-features/[環境変数] として指定する方法です。これらは、次のセクションに示すように `jvm.args` として指定できます。

source: The second approach is to use `quarkus.hibernate-orm.database.generation=update`. This approach is best when you do many entity changes but still need to work on a copy of the production data or if you want to reproduce a bug that is based on specific database entries. `update` is a best effort from Hibernate ORM and will fail in specific situations including altering your database structure which could lead to data loss. For example if you change structures which violate a foreign key constraint, Hibernate ORM might have to bail out. But for development, these limitations are acceptable.
ja_jp: 2つ目の選択肢は `quarkus.hibernate-orm.database.generation=update` を使用することです。 この方法は、多くのエンティティを変更するが本番データのコピーで作業する必要がある場合や、特定のデータベースのデータエントリーに基づくバグを再現する場合に最適です。 `update` は Hibernate ORM によってベストエフォートで実行され、データ損失につながるデータベース構造の変更を含む特定の状況では失敗します。 例えば、外部キー制約に違反する構造を変更する場合、Hibernate ORM の挙動を助けてあげなければならないかもしれません。 しかし、開発中だとこれらの制限は許容範囲内です。

source: The second approach is to use `quarkus.hibernate-orm.schema-management.strategy=update`. This approach is best when you do many entity changes but still need to work on a copy of the production data or if you want to reproduce a bug that is based on specific database entries. `update` is a best effort from Hibernate ORM and will fail in specific situations including altering your database structure which could lead to data loss. For example if you change structures which violate a foreign key constraint, Hibernate ORM might have to bail out. But for development, these limitations are acceptable.
ja_jp: 2 つ目のアプローチは、 `quarkus.hibernate-orm.schema-management.strategy=update` を使用することです。このアプローチは、多くのエンティティー変更を行うが、依然として本番データのコピーで作業する必要がある場合や、特定のデータベースエントリーに基づくバグを再現したい場合に最適です。 `update` は Hibernate ORM によるベストエフォートの処理であり、データベース構造の変更によるデータ損失など、特定の状況では失敗することがあります。例えば、外部キー制約に違反する構造に変更した場合、Hibernate ORM が処理を断念せざるを得ない場合があります。しかし、開発においては、これらの制限は許容できるものです。

source: The second approach to attach model classes to a persistence unit is to use package-level `@io.quarkus.hibernate.orm.PersistenceUnit` annotations. Again, the two approaches cannot be mixed.
ja_jp: モデルクラスを永続化ユニットにアタッチする2つ目の方法は、パッケージレベルの `@io.quarkus.hibernate.orm.PersistenceUnit` アノテーションを使用することです。 繰り返しになりますが、この2つのアプローチを混在させることはできません。

source: The second configuration is provided by `TenantConfigResolver`, it is the configuration that will be used when an incoming request is mapped to the tenant `tenant-a`.
ja_jp: 2つ目の設定は `TenantConfigResolver` によって提供されます。これは、受信リクエストがテナント `tenant-a` にマッピングされるときに使用される設定です。

source: The second configuration is the configuration that will be used when an incoming request is mapped to the tenant `tenant-a`.
ja_jp: 2 番目の設定は、受信リクエストがテナント `tenant-a` にマップされる場合に使用される設定です。
